In [1]:
import pandas as pd

In [11]:
india_weather=pd.DataFrame({
    "city": ['Mumbai','Delhi','Bangalore'],
    "temperature": [32,45,30],
    "humidity": [80,60,78]
})
india_weather

        city  temperature  humidity
0     Mumbai           32        80
1      Delhi           45        60
2  Bangalore           30        78

In [12]:
us_weather=pd.DataFrame({
    "city": ['new york','chicago','ornaldo'],
    "temperature": [21,14,30],
    "humidity": [68,65,78]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   ornaldo           30        78

# Concatenate as rows
# axis=0 will concatenate as rows

In [21]:
df=pd.concat([india_weather,us_weather],axis=0)
df

        city  temperature  humidity
0     Mumbai           32        80
1      Delhi           45        60
2  Bangalore           30        78
0   new york           21        68
1    chicago           14        65
2    ornaldo           30        78

In [14]:
#but index of new york again started from 0 so
#to get index serially from 0 to 5

df=pd.concat([india_weather,us_weather], ignore_index=True)
df

        city  temperature  humidity
0     Mumbai           32        80
1      Delhi           45        60
2  Bangalore           30        78
3   new york           21        68
4    chicago           14        65
5    ornaldo           30        78

# two different keys

In [16]:
df=pd.concat([india_weather,us_weather], keys=['india','usa'])
df

              city  temperature  humidity
india 0     Mumbai           32        80
      1      Delhi           45        60
      2  Bangalore           30        78
usa   0   new york           21        68
      1    chicago           14        65
      2    ornaldo           30        78

# to get a subset of data frame

In [17]:
df.loc['india']  #to get a subset of data frame

        city  temperature  humidity
0     Mumbai           32        80
1      Delhi           45        60
2  Bangalore           30        78

In [18]:
df.loc['usa']  #to get a subset of data frame

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   ornaldo           30        78

# to append 2nd dataframe as a column
# axis=1 will concatenate as column

In [19]:
temperature_df=pd.DataFrame({
    "city": ['Mumbai','Delhi','Bangalore'],
    "temperature": [32,45,30],
    
})
temperature_df

        city  temperature
0     Mumbai           32
1      Delhi           45
2  Bangalore           30

In [20]:
windspeed_df=pd.DataFrame({
    "city": ['Mumbai','Delhi','Bangalore'],

    "windspeed": [7,12,9]
})
windspeed_df

        city  windspeed
0     Mumbai          7
1      Delhi         12
2  Bangalore          9

In [23]:
df=pd.concat([temperature_df,windspeed_df],axis=1)
df

        city  temperature       city  windspeed
0     Mumbai           32     Mumbai          7
1      Delhi           45      Delhi         12
2  Bangalore           30  Bangalore          9

In [ ]:
#here mumbai -- mumbai 
# delhi-- delhi 
# bangalore- bangalore bacause it follows index of previous dataframes

# if mumbai is first in one data frame and delhi is first in another data frame then....

In [24]:
temperature_df=pd.DataFrame({
    "city": ['Mumbai','Delhi','Bangalore'],
    "temperature": [32,45,30],
    
}, index=[0,1,2])
temperature_df

        city  temperature
0     Mumbai           32
1      Delhi           45
2  Bangalore           30

In [26]:
windspeed_df=pd.DataFrame({
    "city": ['Delhi','Mumbai'],
    "windspeed": [12,7]
}, index=[1,0])    #previous index of Delhi is 1 and Mumbai is 0
windspeed_df       # we can pass the index to solve it

     city  windspeed
1   Delhi         12
0  Mumbai          7

In [27]:
df=pd.concat([temperature_df,windspeed_df],axis=1)
df

        city  temperature    city  windspeed
0     Mumbai           32  Mumbai        7.0
1      Delhi           45   Delhi       12.0
2  Bangalore           30     NaN        NaN

In [28]:
temperature_df

        city  temperature
0     Mumbai           32
1      Delhi           45
2  Bangalore           30

# to create a series

In [30]:
s= pd.Series(["humid","dry","rain"], name="event")
s

0    humid
1      dry
2     rain
Name: event, dtype: object

# concate temperature and series as column

In [32]:
df=pd.concat([temperature_df,s],axis=1)
df

        city  temperature  event
0     Mumbai           32  humid
1      Delhi           45    dry
2  Bangalore           30   rain

# what if we can get index correctly without passing index number?

# This can be done by merge dataframes

# join two dataframes

In [33]:
import pandas as pd

In [35]:
df1=pd.DataFrame({
    "city": ["New york", "chicago", "ornaldo"],
    "temperature": [21,14,30]
})
df1

       city  temperature
0  New york           21
1   chicago           14
2   ornaldo           30

In [37]:
df2=pd.DataFrame({
    "city": ["chicago","New york", "ornaldo"],
    "humidity": [65,68,75]
})
df2

       city  humidity
0   chicago        65
1  New york        68
2   ornaldo        75

In [38]:
df3=pd.merge(df1,df2,on='city')
df3

       city  temperature  humidity
0  New york           21        68
1   chicago           14        65
2   ornaldo           30        75

# if any element is missing then

# inner join~ intersection ~common data elements will be printed

In [39]:
df1=pd.DataFrame({
    "city": ["New york", "chicago", "ornaldo"],
    "temperature": [21,14,30]
})
df1

       city  temperature
0  New york           21
1   chicago           14
2   ornaldo           30

In [40]:
df4=pd.DataFrame({
    "city": ["chicago","New york", "san franscisco"],
    "humidity": [65,68,75]
})
df4

             city  humidity
0         chicago        65
1        New york        68
2  san franscisco        75

In [41]:
#inner join is default

df5=pd.merge(df1,df4,on='city')
df5                  #only new york and chicago will be printed out

       city  temperature  humidity
0  New york           21        68
1   chicago           14        65

# outer join~ Union ~ all data elements will be printed

In [42]:
df5=pd.merge(df1,df4,on='city',how='outer')
df5

             city  temperature  humidity
0        New york         21.0      68.0
1         chicago         14.0      65.0
2         ornaldo         30.0       NaN
3  san franscisco          NaN      75.0

# data from left or right

In [43]:
df5=pd.merge(df1,df4,on='city',how='left')
df5

       city  temperature  humidity
0  New york           21      68.0
1   chicago           14      65.0
2   ornaldo           30       NaN

In [44]:
df5=pd.merge(df1,df4,on='city',how='right')
df5

             city  temperature  humidity
0         chicago         14.0        65
1        New york         21.0        68
2  san franscisco          NaN        75

# Using indicators to know where the data came from

In [45]:
df5=pd.merge(df1,df4,on='city',how='outer',indicator=True) 
df5

             city  temperature  humidity      _merge
0        New york         21.0      68.0        both
1         chicago         14.0      65.0        both
2         ornaldo         30.0       NaN   left_only
3  san franscisco          NaN      75.0  right_only

# If any city have different data in different data frame

In [3]:
df1=pd.DataFrame({
    "city": ["New york", "chicago", "ornaldo","baltimore"],
    "temperature": [21,14,35,38],
    "humidity": [65,68,71,75]
})
df1

        city  temperature  humidity
0   New york           21        65
1    chicago           14        68
2    ornaldo           35        71
3  baltimore           38        75

In [4]:
df2=pd.DataFrame({
    "city": ["chicago","New york", "san franscisco"],
     "temperature": [21,14,35],
    "humidity": [65,68,71]
})
df2

             city  temperature  humidity
0         chicago           21        65
1        New york           14        68
2  san franscisco           35        71

In [6]:
df3=pd.merge(df1,df2,on='city')
df3

       city  temperature_x  humidity_x  temperature_y  humidity_y
0  New york             21          65             14          68
1   chicago             14          68             21          65

In [7]:
df3=pd.merge(df1,df2,on='city',suffixes=('_left','_right'))
df3

,city,temperature_left,humidity_left,temperature_right,humidity_right
0,New york,21,65,14,68
1,chicago,14,68,21,65